app/controllers/hons_controller.rb

  def index
    @hons = Hon.page(params[:page]).per(PER)
---
SELECT  "hons".* FROM "hons" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "hons"

  def create
    @hon = Hon.new(hon_params)

    respond_to do |format|
      if @hon.save
---
INSERT INTO "hons" ("title", "author", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "春"], ["author", "村上"], ["created_at", "2020-01-26 04:33:57.900046"], ["updated_at", "2020-01-26 04:33:57.900046"]]

  def destroy
    @hon.destroy
---
DELETE FROM "hons" WHERE "hons"."id" = ?  [["id", 1]]

    def set_hon
      @hon = Hon.find(params[:id])
---
SELECT  "hons".* FROM "hons" WHERE "hons"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]