app/controllers/reviews_controller.rb

SELECT  "reviews".* FROM "reviews" LIMIT ? OFFSET ?  [["LIMIT", 25], ["OFFSET", 0]]
---
   def index
   @reviews = Review.page params[:page]

SELECT  "hons".* FROM "hons" WHERE "hons"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
   def set_hon
   @hon = Hon.find(params[:hon_id])